Wolfox/app/Controllers/AdmissionMaster.php

    public function completionletter($id = null)
    {
        $BatchModel = new BatchModel();
        $data['BatchData'] = $BatchModel->findAll();

        $CourseModel = new CourseModel();
        $data['CourseData'] = $CourseModel->findAll();

        $admissionmodel = new AdmissionModel();
        $data['StudentData'] = $admissionmodel
            ->select('admission.*,admission.id AS studid, collegename.collegename AS collegename')
            ->join('collegename', 'collegename.id = admission.collegeid', 'left')->find($id);

        $CollegeModel = new CollegeModel();
        $data['collegeData'] = $CollegeModel->findAll();

        $BranchModel = new BranchModel();
        $data['BranchData'] = $BranchModel->findAll();
---
SELECT *
FROM `batch`
SELECT *
FROM `course`
SELECT `admission`.*, `admission`.`id` AS `studid`, `collegename`.`collegename` AS `collegename`
FROM `admission`
LEFT JOIN `collegename` ON `collegename`.`id` = `admission`.`collegeid`
WHERE `admission`.`id` = '4'
SELECT *
FROM `collegename`
SELECT *
FROM `branch`