Wolfox/app/Controllers/Letter.php

    public function index()
    {
        $session = session();
        $studentid = $session->get('id');
        $AdmissionModel = new AdmissionModel();

        $data['StudentData'] = $AdmissionModel
            ->select('admission.*, admission.socialflag')
            ->where('admission.id', $studentid)
            ->first();

            $data['showModal'] = isset($data['StudentData']) && empty($data['StudentData']['socialflag']);
            $data['studentId'] = $studentid;
        // $data['showModal'] = isset($data['StudentData']) && empty($data['StudentData']['socialflag']);



        $db = \Config\Database::connect();
        $subQuery = $db->table('fee')
            ->select('MAX(id) as id, sid')
            ->groupBy('sid')
            ->getCompiledSelect();

        $AdmissionModel = new AdmissionModel();

        $data['StudentData'] = $AdmissionModel
            ->select('admission.*, admission.id AS studid, fee.*, course.course, course.fee, batch.batchname, batch.starttime, batch.endtime, branch.branchname AS branchname, collegename.collegename AS collegename')
            ->join('course', 'course.courseid = admission.courseid', 'left')
            ->join('batch', 'batch.batchid = admission.batchid', 'left')
            ->join("($subQuery) as latest", 'latest.sid = admission.id', 'left')
            ->join('branch', 'branch.id = admission.branchid', 'left')
            ->join('collegename', 'collegename.id = admission.collegeid', 'left')
            ->join('fee', 'fee.id = latest.id', 'left')
            ->where('admission.status', 1)
            ->where('admission.flag', 1)
            ->orderBy('admission.id', 'DESC')
            ->find($studentid);
---
SELECT `admission`.*, `admission`.`socialflag`
FROM `admission`
WHERE `admission`.`id` = '6'
 LIMIT 1
SELECT `admission`.*, `admission`.`id` AS `studid`, `fee`.*, `course`.`course`, `course`.`fee`, `batch`.`batchname`, `batch`.`starttime`, `batch`.`endtime`, `branch`.`branchname` AS `branchname`, `collegename`.`collegename` AS `collegename`
FROM `admission`
LEFT JOIN `course` ON `course`.`courseid` = `admission`.`courseid`
LEFT JOIN `batch` ON `batch`.`batchid` = `admission`.`batchid`
LEFT JOIN (SELECT MAX(id) as id, `sid`
FROM `fee`
GROUP BY `sid`) as latest ON `latest`.`sid` = `admission`.`id`
LEFT JOIN `branch` ON `branch`.`id` = `admission`.`branchid`
LEFT JOIN `collegename` ON `collegename`.`id` = `admission`.`collegeid`
LEFT JOIN `fee` ON `fee`.`id` = `latest`.`id`
WHERE `admission`.`status` = 1
AND `admission`.`flag` = 1
AND `admission`.`id` = '6'
ORDER BY `admission`.`id` DESC