Wolfox/app/Controllers/NotificationMaster.php

SELECT *
FROM `batch`
---
    public function add()
    {
        $BatchModel = new BatchModel();
        $data['BatchData'] = $BatchModel->findAll();

INSERT INTO `notification` (`message`) VALUES ('<p>fnmkop</p>')
---
    public function save()
    {
        $message = $this->request->getvar('editor');
        $batchid = $this->request->getvar('batchid');
        // $image = $this->request->getFile('image');


            $notitfications = [
                'message' => $message,
                'batchid' => $batchid
             ];


            //  print_r($notitfications);
            //  exit;



            $OtherLetterModel = new NotificationModel();
            $OtherLetterModel->insert($notitfications);

SELECT *
FROM `batch`
SELECT `notification`.*, `batch`.*
FROM `notification`
JOIN `batch` ON `batch`.`batchid` = `notification`.`id`
---
    public function list()
    {
        $BatchModel = new BatchModel();
        $data['BatchData'] = $BatchModel->findAll();

        $NotificationModel = new NotificationModel();
        $data['notifications'] = $NotificationModel
            ->select('notification.*, batch.*')
            ->join('batch', 'batch.batchid = notification.id')
            ->find();

DELETE FROM `notification`
WHERE `id` = '2'
AND `id` IN ('2')
---
    public function delete($id = null)
    {

        $NotificationModel = new NotificationModel();
        if ($id) {
            $data = $NotificationModel->where('id', $id)->delete($id);